const Lottery = {
  type:{
    SSQ:'01',
    FC3D:'03',
    SSC:'04',
    QLC:'07',
    XK3:'10',
    DLT:'50',
    QXC:'51',
    PL5:'52',
    PL3:'53',
    GD11X5:'55',
    HB11X5:'59',
  },
  zstLottery:{
    ssq:'01',
    fc3d:'03',
    qlc:'07',
    dlt:'50',
    qxc:'51',
    pl3:'53',
    pl5:'52',
    k3:'06',
    x11x5:'59',
    y11x5:'55'
  },
  /**
   * @description 根据彩种id 获取信息
   * @param {number} n 彩种id 不可空
   * @param {number} m 为空默认0( 0-彩种名 1-彩种位置 2-彩种对应合买里面的索引)
   * @example CP.Util.lot(1,1);return ssq
   * @return {str} 返回需要的信息
   */
  lot(n, m) {
    m = m || '0';
    let lot = {
      '01': ['双色球', 'ssq', '6','双色球'],
      '03': ['福彩3D', '3d', '7','福彩3D'],
      '04': ['时时彩', 'ssc', '','时时彩'],
      '05': ['吉林快3', 'k3', '','吉林快3'],
      '06': ['快3', 'ahk3', '','快3'],
      '07': ['七乐彩', 'qlc', '8','七乐彩'],
      '08': ['福彩快3', 'nmk3', '','福彩快3'],
      '09': ['江苏快3', 'k3', '','江苏快3'],
      '10': ['新快3', 'xk3', '','新快3'],
      '20': ['新时时彩', 'jxssc', '','新时时彩'],
      '50': ['大乐透', 'dlt', '9','大乐透'],
      '51': ['七星彩', 'qxc', '10','七星彩'],
      '52': ['排列五', 'p5', '12','排列五'],
      '53': ['排列三', 'p3', '11','排列三'],
      '54': ['11选5', '11x5', '','11选5'],
      '55': ['粤11选5', 'gd11x5', '','粤11选5'],
      '56': ['11运夺金', '11ydj', '','11运夺金'],
      '57': ['沪11选5', 'sh11x5', '','沪11选5'],
      '58': ['快乐扑克3', 'pk3', '','快乐扑克3'],
      '59': ['新11选5', 'hb11x5', '','新11选5'],
      '80': ['胜负彩', 'sfc', '3','胜负彩'],
      '81': ['任选九', 'r9', '4','任选九'],
      '82': ['进球彩', 'jq', '','进球彩'],
      '83': ['半全场', 'bq', '','半全场'],
      '84': ['单场-胜负过关', 'sfgg', '5','胜负过关'],
      '85': ['单场-胜平负', 'bjdc', '5','单场竞猜'],
      '86': ['单场-比分', 'bjdc', '5','单场竞猜'],
      '87': ['单场-半全场', 'bjdc', '5','单场竞猜'],
      '88': ['单场-上下单双', 'bjdc', '5','单场竞猜'],
      '89': ['单场-总进球', 'bjdc', '5','单场竞猜'],
      '90': ['竞彩-让球', 'jczq', '1','竞彩足球'],
      '91': ['竞彩-比分', 'jczq', '1','竞彩足球'],
      '92': ['竞彩-半全场', 'jczq', '1','竞彩足球'],
      '93': ['竞彩-总进球', 'jczq', '1','竞彩足球'],
      '70': ['竞彩-混投', 'jczq', '1','竞彩足球'],
      '72': ['竞彩-胜平负', 'jczq', '1','竞彩足球'],
      '94': ['篮彩-胜负', 'jclq', '2','竞彩篮球'],
      '95': ['篮彩-让分', 'jclq', '2','竞彩篮球'],
      '96': ['篮彩-胜分差', 'jclq', '2','竞彩篮球'],
      '97': ['篮彩-大小分', 'jclq', '2','竞彩篮球'],
      '98': ['欧洲杯-猜冠军', 'cgj', '2','欧洲杯'],
      '99': ['欧洲杯-猜冠亚军', 'gyj', '2','欧洲杯'],
      '71': ['篮彩-混投', 'jclq', '2','竞彩篮球']
    };
    return lot[n][m];
  },
  szc:['01','03','07','50','51','52','53'],
  kpc:['04','05','06','08','09','10','54','55','56','57','58','59'],
  jjc:['70','71','72','73','74','80','81','82','83','84','85','86','87','88','89','90','91','92','93','94','95','96','97','98','99'],
  exceptJJC:['70','71','72','73','74','82','83','84','85','86','87','88','89','90','91','92','93','94','95','96','97','98','99'],
  rechargeBackUrl:{

  }
}
export default Lottery
